 # Hussein kaplan - حسين قبلان
 # معرفة برمجيا بلغة البايثون اذا كان الرقم عدد اولي ام لا 
# الطريقة الثانية 
num = 79

# اذا كنت تريد اخد الرقم من المستخدم تستخدم هذا السطر
#num = int(input("ادخل الرقم: "))


# الاعداد الاولية تكون اكبر من واحد
if num > 1:
    # التحقق من العوامل
    for i in range(2, num):
        if (num % i) == 0:
            print(num,"ليس عدد اولي")
            print(i,"مرات",num//i,"هو",num)
            break
    else:
       print(num,"هو عدد اولي")
       
# إذا كان رقم الإدخال أقل من
# أو يساوي 1 ، فهو ليس عددًا أوليًا
else:
   print(num,"ليس عدد اولي")