 # Hussein kaplan - حسين قبلان
 # معرفة برمجيا بلغة البايثون اذا كان الرقم عدد اولي ام لا 

num = 79

# اذا كنت تريد اخد الرقم من المستخدم تستخدم هذا السطر
#num = int(input("ادخل الرقم: "))

# flag تعريف متغير 
flag = False

# الاعداد الاولية تكون اكبر من واحد
if num > 1:
    # التحقق من العوامل
    for i in range(2, num):
        if (num % i) == 0:
            # True على  flag اذا تم العثور على عامل فاضبظ المتغير 
            flag = True
            # الخروج من السلسلة
            break

# صحيحًا Flag تحقق مما إذا كان  
if flag:
    print(num, "ليس عددا اوليا")
else:
    print(num, "هو عدد اولي")