import random
when = ['قبل عدة سنوات', 'البارحة', 'البارحة بالليل', 'قبل مدة طويلة']
who = ['حرامي', 'فيل', 'فارة', 'اسد','قطة']
name = ['علي', 'مريم','عمر', 'باتمان', 'ابو جاسم']
residence = ['تلعفر','علولي', 'موصل', 'اربيل', 'حسنكوي']
went = ['سينما', 'جامعة','ساحة', 'مدرسة', 'شارع']
happened = ['كون العديد من الاصدقاء','اكل كباب', 'وجد المفتاح السري', 'حل المشكلة', 'كتب كتاب']
print(random.choice(when) + ', ' + random.choice(who) + ' الي يعيش بال ' + random.choice(residence) + ' , راح لشسمه ' + random.choice(went) + ' و ' + random.choice(happened))